[
  {
    "company": "iTalent Digital, Hyderabad",
    "role": "Java Full Stack Developer Intern",
    "type": "Internship",
    "duration": "Nov 2021 - Feb 2022",
    "icon": "/icons/italent.png",
    "description": "Completed a hands-on internship focused on building and enhancing full-stack applications using Java, Spring Boot, and React.",
    "responsibilities": [
      "Assisted in developing scalable web applications using Java, Spring Boot, and React.js.",
      "Supported REST API integration and basic database operations.",
      "Collaborated with senior developers to fix bugs and implement new features.",
      "Gained exposure to version control workflows using Git."
    ]
  },
  {
    "company": "iTalent Digital, Hyderabad",
    "role": "Java Full Stack Developer",
    "type": "Full-Time",
    "duration": "March 2022 - June 2025",
    "icon": "/icons/italent.png",
    "description": "Worked as a full-time developer contributing to enterprise-level applications with end-to-end development responsibilities.",
    "responsibilities": [
      "Developed complex backend modules using Java, Spring Boot, and Microservices architecture.",
      "Designed and integrated REST APIs to support business workflows.",
      "Implemented front-end features using React.js with optimized performance.",
      "Worked with CI/CD pipelines using Jenkins and Git for smooth deployments.",
      "Collaborated cross-functionally with QA, DevOps, and product teams."
    ]
  },
  {
    "company": "Lloyds Banking Group",
    "role": "Java Full Stack Developer",
    "type": "Full-Time",
    "duration": "July 2025 - Present",
    "icon": "/icons/lloyds.png",
    "description": "Responsible for leading development of secure and high-performance banking applications while improving system reliability.",
    "responsibilities": [
      "Leading full-stack development initiatives for banking and financial applications.",
      "Optimizing backend performance, improving API reliability, and reducing latency.",
      "Managing cloud deployment workflows and infrastructure optimizations.",
      "Mentoring junior developers and conducting thorough code reviews.",
      "Collaborating with stakeholders to refine requirements and deliver scalable solutions."
    ]
  }
]
